<template>
    <div class="content">
        <my-content-title
            :text="['Как вести себя', 'На первом', 'Свидании']"
            :number="3"
            :img="'src/assets/content-images/content3.png'"
        >
        </my-content-title>
        <my-accordion title="Будьте собой, но не теряйте лицо">
            <p class="tab--paragraph">Вы интуитивно будете стараться произвести самое приятное впечатление: на первое свидание люди приносят лучшую версию себя. Но не пытайтесь показаться идеальным человеком.</p>

            <p class="tab--paragraph">Люди испытывают симпатию к чужим слабостям, а совершенство, наоборот, вызывает недоверие. Если нервничаете, не стесняйтесь сказать: «Я немного волнуюсь, в первый раз иду на свидание после знакомства в интернете». Честность располагает, к тому же партнёр поймёт, что ради свидания с ним вы преодолели свои страхи.</p>

            <p class="tab--paragraph">Однако, какой бы оборот ни принимал вечер, не теряйте спокойствия и приветливости. Не закипайте, если в кафе официант перепутает заказ, не кричите на таксиста, повернувшего не туда, не показывайте нетерпение в очереди. Даже если вы частенько так делаете. Малознакомый человек может спроецировать любую негативную эмоцию на себя или подумать, что вы склочник и неврастеник</p>
        </my-accordion>
        <my-accordion title="Будьте собой, но не теряйте лицо">
            <p class="tab--paragraph">Вы интуитивно будете стараться произвести самое приятное впечатление: на первое свидание люди приносят лучшую версию себя. Но не пытайтесь показаться идеальным человеком.</p>

            <p class="tab--paragraph">Люди испытывают симпатию к чужим слабостям, а совершенство, наоборот, вызывает недоверие. Если нервничаете, не стесняйтесь сказать: «Я немного волнуюсь, в первый раз иду на свидание после знакомства в интернете». Честность располагает, к тому же партнёр поймёт, что ради свидания с ним вы преодолели свои страхи.</p>

            <p class="tab--paragraph">Однако, какой бы оборот ни принимал вечер, не теряйте спокойствия и приветливости. Не закипайте, если в кафе официант перепутает заказ, не кричите на таксиста, повернувшего не туда, не показывайте нетерпение в очереди. Даже если вы частенько так делаете. Малознакомый человек может спроецировать любую негативную эмоцию на себя или подумать, что вы склочник и неврастеник</p>
        </my-accordion>
        <my-accordion title="Будьте собой, но не теряйте лицо">
            <p class="tab--paragraph">Вы интуитивно будете стараться произвести самое приятное впечатление: на первое свидание люди приносят лучшую версию себя. Но не пытайтесь показаться идеальным человеком.</p>

            <p class="tab--paragraph">Люди испытывают симпатию к чужим слабостям, а совершенство, наоборот, вызывает недоверие. Если нервничаете, не стесняйтесь сказать: «Я немного волнуюсь, в первый раз иду на свидание после знакомства в интернете». Честность располагает, к тому же партнёр поймёт, что ради свидания с ним вы преодолели свои страхи.</p>

            <p class="tab--paragraph">Однако, какой бы оборот ни принимал вечер, не теряйте спокойствия и приветливости. Не закипайте, если в кафе официант перепутает заказ, не кричите на таксиста, повернувшего не туда, не показывайте нетерпение в очереди. Даже если вы частенько так делаете. Малознакомый человек может спроецировать любую негативную эмоцию на себя или подумать, что вы склочник и неврастеник</p>
        </my-accordion>
    </div>

</template>

<script>
    import myContentTitle from './myContentTitle'
    import myAccordion from './myAccordion'
    export default {
        name: "myContentComponent",
        components: {
            myContentTitle,
            myAccordion
        }
    }
</script>

<style lang="scss" scoped>
    .content{
        position: relative;
        @media (min-width: 678px) {
            width: 90%;
        }
        @media (min-width: 1000px) {
            width: 76%;
        }
        @media (min-width: 1920px) {
            width: 59%;
        }
        &--paragraph{
            padding: 0 20px;
            font-family: Montserrat regular, sans-serif;
            font-size: 16px;
        }
    }
    .tab{
        &--paragraph{
            padding: 0 20px;
        }
    }
</style>