<template>
    <div class="content">
        <my-content-title
            :text="['Где найти', ' свою Любовь']"
            :number="2"
            :img="'src/assets/content-images/content2.png'"
        >
        </my-content-title>
        <div class="content--container">
            <div class="content--image--container">
                <div class="content--sub-title">В интернете</div>
                <div><img src="../assets/obl_01_5.png" class="content--image"></div>
            </div>
            <div class="content--paragraph--container">
                <div class="content--paragraph--sub-container">
                    <h3 class="content--paragraph--title">Приложения и сайты знакомств</h3>
                    <p class="content--paragraph">
                        Виртуальные знакомства не требуют больших усилий и доступны самым стеснительным и скромным. Как правило, переписка начинается только в случае обоюдной симпатии, поэтому вы не тратите время на бессмысленное общение.
                    </p>
                    <p class="content--paragraph">
                        С другой стороны, онлайн-знакомства заставляют много времени проводить в интернете и редко заканчиваются крепким союзом. Бывает, что пользователи таких сайтов настроены не на серьёзные отношения, а на мимолётную интрижку. А для кого-то это просто способ развлечься и скоротать время.
                    </p>
                    <p class="content--paragraph">
                        Но не стоит отбрасывать онлайн-знакомства как вариант. Вы можете найти людей с похожими интересами, хобби и взглядами на жизнь, которых вы не встретили бы в реальной жизни.
                    </p>
                </div>
                <div class="content--paragraph--sub-container">
                    <h3 class="content--paragraph--title">Социальные</h3>
                    <p class="content--paragraph">
                        Хотя «ВКонтакте», Facebook и Instagram не заточены под знакомства, в соцсетях есть удобный поиск, тематические сообщества и группы, посвящённые предстоящим тусовкам. По личной странице пользователя проще понять, какой перед вами человек: чем увлекается, с кем дружит и куда последний раз ездил в отпуск.
                    </p>
                    <p class="content--paragraph">
                        Сложность знакомства в соцсетях — начать переписку и не испортить первое впечатление. Банальное «Привет, как дела?» не подойдёт, но и открыто флиртовать тоже не стоит. Вполне возможно, что человек, которому вы пишете, не ищет отношений.
                    </p>
                    <p class="content--paragraph">
                        Пишите грамотно и обращайтесь на «вы». Если переписка выходит оживлённой, можно отметить это и предложить перейти на «ты». Ставьте лайки и пишите комментарии — они ни к чему не обязывают, но показывают, что вы были на странице пользователя и просматривали его профиль.
                    </p>
                    <p class="content--paragraph">
                        Чтобы придумать, что написать, действуйте по обстоятельствам. Например, если нашли человека в тематической группе, спросите что-нибудь о хобби. Понравился парень-байкер — спросите у него, когда будет открытие мото-сезона и как в нём поучаствовать. Девушка выкладывает фотографии с утренних пробежек — поинтересуйтесь, как ей удаётся так рано вставать, потому что вы тоже хотите (если хотите, конечно).
                    </p>
                </div>
            </div>
        </div>
        <div class="content--container">
            <div class="content--image--container">
                <div class="content--sub-title">В реальной жизни</div>
                <div><img src="../assets/IRL.png" class="content--image"></div>
            </div>
            <div class="content--paragraph--container">
                <p>
                    Тем, кто привык общаться в интернете, традиционные способы знакомства могут казаться странными и неуместными. Мы с подозрением относимся к незнакомцам на улице, в метро или супермаркете и ждём подвоха — вдруг это мошенник или городской сумасшедший. Опускать руки не стоит: люди по-прежнему находят друг друга в реальной жизни.
                </p>
                <div class="content--paragraph--sub-container">
                    <h3>Среди общих</h3>
                    <p>
                        Примерно 30% пар знакомятся через общих друзей. Произойти это может как угодно: на вечеринке, в поездке за город на шашлыки. Знакомства через общих друзей нередко заканчиваются крепким союзом, потому что у пары примерно одинаковый социальный статус и схожие интересы.
                    </p>
                </div>
                <div class="content--paragraph--sub-container">
                    <h3>В кафе, в баре</h3>
                    <p>
                        По статистике, 20% людей находят партнёра в баре или ресторане. Расслабленная обстановка, музыка и алкоголь способствуют новым знакомствам. Но знакомство в баре больше подходит для краткосрочных связей, а не для построения отношений на всю жизнь.
                    </p>
                </div>
                <div class="content--paragraph--sub-container">
                    <h3>На работе</h3>
                    <p>
                        Найти свою любовь можно среди коллег. Чем больше коллектив, тем выше шансы. Но будьте осторожны: отношения могут мешать работе, вызывать вопросы у начальства и сплетни среди коллег.
                    </p>
                    <p>
                        В то же время общая работа сближает: вы вместе завтракаете и едете в офис, вам есть с кем обсудить трудности и у кого попросить помощи.
                    </p>
                </div>
                <div class="content--paragraph--sub-container">
                    <h3>На тусовках по интересам</h3>
                    <p>
                        Будущего партнёра можно найти на тематических встречах: интеллектуальных или спортивных играх, концертах, выставках или лекциях. Если вы интроверт, берите с собой друга или подругу и выбирайте события, которые вам действительно интересны. На них вы с большей вероятностью встретите человека со схожими взглядами и сможете завязать знакомство.
                    </p>
                </div>
                <div class="content--paragraph--sub-container">
                    <h3>На быстрых свиданиях</h3>
                    <p>
                        Это специально организованные свидания с большим количеством участников. Обычно они устроены примерно так: двое людей общаются в течение нескольких минут, затем пары меняются. За короткое время нужно произвести впечатление на партнёра. Если симпатия взаимна, вы обмениваетесь контактами.
                    </p>
                </div>
                <div class="content--paragraph--sub-container">
                    <h3>Там, где вы часто бываете</h3>
                    <p>
                        Найти партнёра можно где угодно: в супермаркете, метро или спортивном зале. Любовь может стоять рядом, ожидая зелёного сигнала светофора или сидеть за соседним столиком в кафе. Проблема в том, что начать знакомство очень страшно — вам может казаться, что лучше вовсе не знакомиться, чем получить отказ.
                    </p>
                    <p>
                        Универсального совета, как побороть страх, нет, но есть работающая фраза: «Лучше сделать и пожалеть, чем не сделать, но всё равно пожалеть». В худшем случае вы получите отказ, в лучшем — найдёте партнёра всей своей жизни. В этом явно больше смысла, чем страдать из-за своей нерешительности и не знакомиться ни с кем.
                    </p>
                </div>
            </div>
        </div>
    </div>

</template>

<script>
    import myContentTitle from './myContentTitle'
    export default {
        name: "myContentComponent",
        components: {
            myContentTitle
        }
    }
</script>

<style lang="scss" scoped>
    .content{
        position: relative;
        @media (min-width: 678px) {
            width: 90%;
        }
        @media (min-width: 1000px) {
            width: 76%;
        }
        @media (min-width: 1920px) {
            width: 59%;
        }
        &--paragraph{
            font-family: Montserrat regular, sans-serif;
            font-size: 16px;
            margin-bottom: 0;
            &--container{
                width: 90%;
            }
            &--sub-container{
                border-bottom: 2px solid #44c5d8;
                &:last-child{
                    border: none;
                }
            }
        }
        &--image{
            width: 100%;
            @media (min-width: 1000px) {
                object-fit: cover;
                height: 720px;
            }
            &--container{
                @media (min-width: 1000px) {
                    margin-right: 20px;
                    padding-top: 20px;
                }
            }
        }
        &--sub-title{
            font-family: Montserrat bold,sans-serif;
            font-size: 25px;
            text-transform: uppercase;
            color: #00bbd2;
            @media (min-width: 1000px) {
                text-align: end;
            }
        }
        &--container{
            display: flex;
            flex-direction: column;
            align-items: center;
            margin-top: 20px;
            @media (min-width: 1000px) {
                flex-direction: row;
                align-items: unset;
                transform: translateX(-29%);
                width: 80vw;
            }
            @media (min-width: 1920px) {
                transform: translateX(-40.3%);
            }
        }
    }
</style>