<template>
    <div class="content">
        <my-content-title
            :text="['Как понять', 'Что вы нашли', 'своего человека']"
            :number="4"
            :img="'src/assets/content-images/content4.png'"
        >
        </my-content-title>
        <my-paginator :list-data="paginatorContent"></my-paginator>
    </div>

</template>

<script>
    import myContentTitle from './myContentTitle'
    import myPaginator from './myPaginator'
    export default {
        name: "myContentComponent",
        components: {
            myContentTitle,
            myPaginator
        },
        data(){
            return{
                paginatorContent: [
                    {
                        title:'Вы подходите друг другу по образу жизни',
                        content:'Речь о совместимости: вы живёте примерно в одном ритме, у вас похожие ценности и взгляды на быт. Или, как минимум, не противоположные. Людям трудно ужиться, если один предпочитает шумные вечеринки, а другой — тихие домашние вечера. Спросите себя, готовы ли вы терпеть человека со всеми его недостатками или вам сложно скрывать раздражение.'
                    },
                    {
                        title:'Вы подходите друг другу по образу жизни2',
                        content:'2Речь о совместимости: вы живёте примерно в одном ритме, у вас похожие ценности и взгляды на быт. Или, как минимум, не противоположные. Людям трудно ужиться, если один предпочитает шумные вечеринки, а другой — тихие домашние вечера. Спросите себя, готовы ли вы терпеть человека со всеми его недостатками или вам сложно скрывать раздражение.'
                    },
                    {
                        title:'Вы подходите друг другу по образу жизни3',
                        content:'3Речь о совместимости: вы живёте примерно в одном ритме, у вас похожие ценности и взгляды на быт. Или, как минимум, не противоположные. Людям трудно ужиться, если один предпочитает шумные вечеринки, а другой — тихие домашние вечера. Спросите себя, готовы ли вы терпеть человека со всеми его недостатками или вам сложно скрывать раздражение.'
                    },
                    {
                        title:'Вы подходите друг другу по образу жизни4',
                        content:'4Речь о совместимости: вы живёте примерно в одном ритме, у вас похожие ценности и взгляды на быт. Или, как минимум, не противоположные. Людям трудно ужиться, если один предпочитает шумные вечеринки, а другой — тихие домашние вечера. Спросите себя, готовы ли вы терпеть человека со всеми его недостатками или вам сложно скрывать раздражение.'
                    },
            ]
            }
        }
    }
</script>

<style lang="scss" scoped>
    .content{
        position: relative;
        @media (min-width: 678px) {
            width: 90%;
        }
        @media (min-width: 1000px) {
            width: 76%;
        }
        @media (min-width: 1920px) {
            width: 59%;
        }
        &--paragraph{
            padding: 0 20px;
            font-family: Montserrat regular, sans-serif;
            font-size: 16px;
        }
    }
</style>