<template>
    <div class="content">
        <my-content-title
            :text="['Что делать, если не', 'Получается', 'найти любовь']"
            :number="5"
            :img="'src/assets/content-images/content5.png'"
        >
        </my-content-title>
        <p>
            Эти советы могут вам не понравиться, потому что согласно им нужно начать с себя. Но это поможет понять, чего вы хотите от любви и как найти своего человека.
        </p>
        <div class="content--container">
            <div class="content--image--container">
                <div><img src="../assets/component5img.png" class="content--image"></div>
            </div>
            <div class="content--paragraph--container">
                <div class="content--paragraph--sub-container">
                    <h3>Оцените плюсы своего положения</h3>
                    <p>
                        Во время поиска второй половинки многие настолько погружаются в грусть и страдания, что забывают наслаждаться жизнью. Не стоит идеализировать отношения — это не только любовь и романтика, но и уступки, компромиссы, частичный отказ от собственных желаний.
                    </p>
                    <p>
                        В данный момент жизни вам не нужно решать такие проблемы, поэтому наслаждайтесь свободой и делайте то, что вам нравится.
                    </p>
                    <p>
                        сихологи регулярно находят подтверждения тому, что люди без серьёзных отношений отнюдь не живут меньше и несчастнее, чем влюблённые парочки. Наоборот, исследования говорят, что такие люди находят больше друзей, продуктивнее проводят свободное время и уделяют больше внимания спорту.
                    </p>
                </div>
                <div class="content--paragraph--sub-container">
                    <h3>
                        Ищите счастье в себе
                    </h3>
                    <p>
                        Если вы несчастны и думаете, что другой человек наполнит вашу жизнь смыслом, это прямая дорога к страданиям в будущих отношениях. Мало кому под силу нести бремя ответственности за чужое счастье.
                    </p>
                    <p>
                        Научитесь находить гармонию в себе: развивайтесь, ищите себя, пробуйте новые направления, ставьте цели и достигайте их. Когда вы довольны собой, вы начинаете сиять. Перед этим очень сложно устоять — люди инстинктивно тянутся к тем, кто счастлив и независим.
                    </p>
                    <p>
                        Наверняка вы и сами предпочли бы быть именно с таким человеком.
                    </p>
                </div>
                <div class="content--paragraph--sub-container">
                    <h3>
                        Подумайте, почему вы еще не встретили любовь
                    </h3>
                    <p>
                        Некоторые люди просто не знают, чего хотят, поэтому бесцельно бросаются из романа в роман. Другие — создают в голове эталон идеального партнёра и не смотрят на простых смертных. Третьи страдают заниженной самооценкой и считают себя недостойными людей, с которыми хотят быть.
                    </p>
                    <p>
                        Будьте честны с собой или поговорите с близкими друзьями — иногда особенности поведения виднее со стороны. Когда вы поймёте, что было преградой всё это время, сможете разрешить проблему: например, больше знакомиться или вспомнить, что никто не идеален, и смягчить
                    </p>
                </div>
                <div class="content--paragraph--sub-container">
                    <h3>
                        Следите за внешним видом
                    </h3>
                    <p>
                        Несмотря на то, что вы сейчас одиноки, не скатывайтесь в неряшливость, думая, что на вас всё равно никто не смотрит.
                    </p>
                    <p>
                        Безусловно, любовь не возникает благодаря одной лишь внешности. Но чтобы дойти до глубоких чувств, нужно сначала заинтересовать человека. Очень часто именно внешняя привлекательность даёт самый первый импульс интереса.
                    </p>
                    <p>
                        Занимайтесь спортом, экспериментируйте со стилем одежды и аксессуаров, решитесь на новую стрижку. Делайте это в первую очередь для себя: чтобы выходить из дома с мыслью «я круто выгляжу». Это придаст вам уверенности, а психологи утверждают, что именно это качество притягивает других людей.
                    </p>
                </div>
                <div class="content--paragraph--sub-container">
                    <h3>
                        Разберитесь, чего вы хотите от партнера
                    </h3>
                    <p>
                        Чтобы что-то найти, нужно знать, что вы ищете. Речь идёт не об идеальных внешних параметрах: такие критерии вообще лучше не задавать. Важнее понимание того, какого человека вы видите рядом с собой.
                    </p>
                    <p>
                        Попробуйте это упражнение: запишите три качества, без которых другой человек вам точно будет не мил. Например, ваш будущий партнёр должен быть добрым, хотеть завести детей и любить спорт. А затем напишите три качества, на которые вы не согласитесь ни при каких обстоятельствах: допустим, самовлюблённость, паникёрство и неприязнь к животным.
                    </p>
                    <p>
                        Даже эта простая структура поможет оценить, кто перед вами: кандидат на счастливые отношения или человек, чьи ценности далеки от ваших.
                    </p>
                </div>
            </div>
        </div>
    </div>

</template>

<script>
    import myContentTitle from './myContentTitle'
    export default {
        name: "myContentComponent",
        components: {
            myContentTitle
        }
    }
</script>

<style lang="scss" scoped>
    .content{
        position: relative;
        @media (min-width: 678px) {
            width: 90%;
        }
        @media (min-width: 1000px) {
            width: 76%;
        }
        @media (min-width: 1920px) {
            width: 59%;
        }
        &--paragraph{
            font-family: Montserrat regular, sans-serif;
            font-size: 16px;
            margin-bottom: 0;
            &--container{
                width: 90%;
            }
            &--sub-container{
                border-bottom: 2px solid #44c5d8;
                &:last-child{
                    border: none;
                }
            }
        }
        &--image{
            width: 100%;
            @media (min-width: 1000px) {
                object-fit: cover;
                height: 720px;
            }
            &--container{
                @media (min-width: 1000px) {
                    margin-right: 20px;
                    padding-top: 20px;
                }
            }
        }
        &--sub-title{
            font-family: Montserrat bold,sans-serif;
            font-size: 25px;
            text-transform: uppercase;
            color: #00bbd2;
            text-align: end;
        }
        &--container{
            display: flex;
            flex-direction: column;
            align-items: center;
            margin-top: 20px;
            @media (min-width: 1000px) {
                flex-direction: row;
                align-items: unset;
                transform: translateX(-29%);
                width: 80vw;
            }
            @media (min-width: 1920px) {
                transform: translateX(-40.3%);
            }
        }
    }
</style>