<template>
    <div id="app">
        <my-header></my-header>
        <my-social-media v-if="$mq !== 'sm'"></my-social-media>
        <main>
            <my-title></my-title>
            <my-form></my-form>
        </main>
        <!--<my-advice :text="psihoFirst"></my-advice>-->
        <!--<my-advice :text="psihoSecond"></my-advice>-->
    </div>
</template>

<script>
import myHeader from './components/myHeader'
import mySocialMedia from './components/mySocialMedia'
import myAdvice from './components/myAdvice'
import myForm from './components/myForm'
import myTitle from './components/myTitle'


export default {
    name: 'app',
    components: {
        myHeader,
        mySocialMedia,
        myAdvice,
        myForm,
        myTitle
    },
    data(){
        return {
            psihoFirst: 'Нет ничего необычного в чувстве тревоги перед знакомством или первым свиданием. Испытывать волнение перед важной встречей нормально. Если же это болезненный парализующий страх, с ним нужно работать: в первую очередь — разбираться в причинах.\n' +
                '\n' +
                'Сильный страх знакомства может быть связан с неприятной ситуацией, пережитой в прошлом. Или с социальным страхом: когда человек боится, что другие увидят в нём нечто постыдное, это приводит к робости и тревоге в общении с другими людьми, причем не только в романтическом контексте. Причиной также может быть чрезмерная фиксация на цели завязать отношения.\n' +
                '\n' +
                'Во многих случаях справиться со страхом знакомства помогает практика. Чем чаще вы знакомитесь, тем реалистичнее будут ожидания при каждой попытке. Если справиться со страхом самостоятельно не удаётся — обратитесь за помощью к психологу.',
            psihoSecond:'Найдёте ли вы партнёра, зависит от множества факторов, многие из которых не в вашей власти. Поэтому не стоит относиться к поиску как к задаче чрезмерной важности: в этом случае в фокусе внимания оказываются не сами отношения, а формальный результат. \n' +
                '\n' +
                'Люди, которые приходят на терапию с сильным желанием найти партнёра, испытывают дискомфорт и фрустрацию, сталкиваясь с неудачей. А отпустив желание непременно реализоваться в сфере отношений, неожиданно легко находят спутника жизни.\n' +
                '\n' +
                'Ощущение готовности вступить в отношения может быть очень приятным. Но это не значит, что вы должны каждую минуту делать всё возможное и невозможное, чтобы найти их. Представьте себе, что отношения — это голубь, которого вы пытаетесь поймать. Если вы преследуете голубя, вы можете его напугать и он улетит. Но если просто протянуть руку и подождать, то, возможно, голубь сядет на неё сам.'
        }
    }
}
</script>

<style lang="scss">
body{
    margin: 0;
    font-family: Montserrat regular, sans-serif;
}
#app {
    display: flex;
    flex-direction: column;
}
main{
    display: flex;
    flex-direction: column;
    width: 90%;
    margin: auto;
    align-items: center;
    @media (min-width: 1000px) {
        width: 80%;
    };
    @media (min-width: 1920px) {
        width: 60%;
    }
}
</style>
